[
  {
    "name": "Breastfeeding Candidate Ads Is Officially a Thing",
    "excerpt": "The ad begins with Vignarajah breastfeeding at home, juxtaposed with photos of every Maryland state and federal elected official, who happen to all be men.",
    "video": "<iframe width=\"637\" height=\"425\" src=\"https://www.youtube.com/embed/czGXjMMi-_g\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
    "html": "<div class=\"overview\">    <a href=\"https://iagreetosee.com/portfolio/kelda-roys-becomes-breastfeed-political-ad-wisconsin/\" rel=\"noopener\" target=\"_blank\">Wisconsin gubernatorial candidate Kelda Roys</a> was the first politician to breastfeed in an ad, and she won\"t be the last. Now Maryland\"s Krish Vignarajah is breastfeeding in her latest spot, emphasizing her gender in a 9-person Democratic gubernatorial primary where she is the only woman.    <h2>Krish Vignarajah Emphasizes Her Gender In Male-Dominated Primary</h2>    The ad begins with Vignarajah breastfeeding at home, juxtaposed with photos of every Maryland state and federal elected official, who happen to all be men.    <br><br>    \"This isn't just about representation,\" the candidate narrates, \"it's about policy. States with women in government have better schools, better healthcare, lower incarceration rates. I want all of that for Maryland.\"    <h2>Krish Vignarajah Argues Governments With Women Make Better Policy</h2>    The Sri Lanka-born Vignarajah offers a quick summary of her background: \"My parents came to this country with $200, and I grew up to be policy director for Michelle Obama.\" A lightning-fast photo montage shows her graduating from Yale University and addressing the United Nations.    <br><br>    Still breastfeeding, she says to the camera, \"Some say no man can beat [incumbent Republican Governor] Larry Hogan. Well, I\"m no man. I\"m a mom. I\"m a woman. And I want to be your next governor.\"    <br><br>    As a longshot candidate who has never run for office before, and who needs to win only a plurality to take the nomination, Vignarajah needs to distinguish herself from the pack. She has, in a way none of her competitors can emulate.    </div>"
  },
  {
    "name": "Democratic Sen. Joe Donnelly Shakes Hands With Trump",
    "excerpt": " Why some Democrats relentlessly hammer Donald Trump, red-state Democratic senators running in the 2018 midterms continue to look for way to show how <a href=\"https://iagreetosee.com/portfolio/jon-tester-fingers/\" rel=\"noopener\" target=\"_blank\">well they work with Trump.</a> ",
    "video": "<iframe width=\"637\" height=\"425\" src=\"https://www.youtube.com/embed/kCxj68UgfmI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
    "html": "<div class=\"overview\">      Why some Democrats relentlessly hammer Donald Trump, red-state Democratic senators running in the 2018 midterms continue to look for way to show how <a href=\"https://iagreetosee.com/portfolio/jon-tester-fingers/\" rel=\"noopener\" target=\"_blank\">well they work with Trump.</a>      <br><br>      The latest is Indiana Sen. Joe Donnelly, who is exploiting the <a href=\"http://www.chicagotribune.com/news/nationworld/politics/ct-trump-joe-donnelly-20180530-story.html\" rel=\"noopener\" target=\"_blank\">surprising praise</a> Trump gave him at a recent bill signing ceremony.      <h2>Sen. Joe Donnelly Promotes \"Right to Try\" Law</h2>      \"Fighting Chance\" touts the \"Right to Try\" law, making it easier for people with life-threatening illness obtain experimental drugs, that Donnelly helped pass.      <br><br>      The ad begins with a mom whose son suffers from a form of muscular dystrophy, and couldn't get a hand on new drugs that could slow the disease's progress. \"Senator Donnelly would not take no for an answer,\" she says from her kitchen, \"he worked with his colleagues from both sides of the aisle. He got it done.\"      <br><br>      The scene shifts to the bill signing, and Trump pointed to Donnelly and saying, \"Senator Donnelly thank you very much.\" The final frame is a still photo of Trump reaching out to shake Donnelly's hand.      <h2>No More \"Sleeping Joe\"</h2>      It was bizarre and eyebrow-raising when Trump praised Donnelly just a few days after campaigning against him as <a href=\"https://www.google.com/url?hl=en&amp;q=https://www.cbsnews.com/news/trump-pence-speak-indiana-taxes-senate-race-mike-braun-joe-donnelly-live-updates/&amp;source=gmail&amp;ust=1532214546039000&amp;usg=AFQjCNFS7XoH2vI94zS1pt8AnKF9K8CfGQ\" rel=\"noopener\" target=\"_blank\">\"Sleeping Joe,\"</a> and now it is obvious why. Trump handed the opposition's party candidate free ad footage, inexplicably so. There was no way Donnelly's political consultants, managing a campaign in a state Trump won by nearly 20 points, were going to pass on a golden opportunity to show the Democrat working across the aisle.      </div>"
  },
  {
    "name": "Gov. Bruce Rauner Yokes J.B. Pritzker to Rod Blagojevich",
    "excerpt": "It didn't take long for the 2018 Illinois gubernatorial election battle between Republican Gov. Bruce Rauner and Democratic businessman J.B. Pritzker to go negative.",
    "video": "<iframe width=\"637\" height=\"425\" src=\"https://www.youtube.com/embed/ys5p3WzVfSs\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
    "html": "<div class=\"overview\">      It didn't take long for the 2018 Illinois gubernatorial election battle between Republican Gov. Bruce Rauner and Democratic businessman J.B. Pritzker to go negative.      <br><br>      The <a href=\"https://www.politico.com/newsletters/morning-score/2018/06/05/what-to-watch-for-on-super-tuesday-241887\">first TV ad</a> of the contest comes from Rauner. It is nothing but an excerpt of phone conversation of Pritzker with then-Gov. Rod Blagojevich, captured in a FBI wiretap as part of its successful corruption investigation.      <h2>Rauner Ad Airs FBI Wiretapped Phone Call</h2>      Pritzker is not heard doing anything illegal, but he sounds awfully chummy when talking about the Senate seat to be vacated by then-President-elect Barack Obama, which Blagojevich had to fill and illegally tried to trade for personal enrichment.      <br><br>      A close-up shot of an old-school reel-to-reel taping apparatus is shown with text making clear to viewers that what they are about to hear is the \"Actual FBI Wiretap of JB Pritzker and Rod Blagojevich.\"      <br><br>      The audio of the conversation is layered with a tense musical score, giving it a feel of a dramatic movie. Black-and-white head shots of each man are juxtaposed with the typewritten transcript of their words.      <h2>J.B. Pritzker Jokes About Senator Jeremiah Wright</h2>      Blagojevich jokingly floats, \"How about Reverend Wright?\" referring to Obama's controversial former pastor. Pritzker chuckles and says it would be \"hilarious,\" after throwing in another controversial Obama acquaintance, Bill Ayers. Both amuse themselves at the spectacle of Wright thundering \"God Damn America\" on the Senate floor. The ad closes with a plug for <a href=\"http://www.pritzkerblago.com/\">a website with the full wiretapped exchange</a>, and other ads featuring snippets of their chat.      <br><br>      By promoting this particular clip, not only is the Rauner campaign reminding voters of Pritzker's friendly relationship with the now-imprisoned Blagojevich, it is also reminding African-American voters about Pritzker's mocking tone towards Wright, especially those in Chicago where Wright's large congregation was based.      <br><br>      However, the ad is being run at a time when Republican President Donald Trump is teasing a pardon or commutation for Blagojevich on the grounds his sentence was politically motivated. While the ad is designed to drive a wedge between African-American voters and Pritzker, if Blagojevich is now being seen in a more sympathetic light among conservatives, that might cost Rauner some votes as well.      <br><br>      The ad is not Rauner's first attempt to yoke Blagojevich to Pritzker. During the primary, the Rauner campaign bought TV time to air the <a href=\"https://www.politico.com/newsletters/illinois-playbook/2018/01/18/rauner-to-air-11-minute-pritzker-blago-tape-in-tv-ads-lipinski-under-unprecedented-attack-from-gutierrez-schakowsky-protesters-demand-obama-center-provide-community-benefits-236940\">entire, unedited 11-minute wiretapped conversation</a> between the two, hoping to either sink Pritzker's nomination or wound his general election prospects. So far, that hasn't happened. Pritzker won the Democrat primary and is leading in general election polls.      </div>"
  },
  {
    "name": "A #MeToo Case Roils South Dakota’s Republican Primary",
    "excerpt": "The 2018 South Dakota gubernatorial primary pits U.S. Rep. Kristi Noem against state Attorney General Marty Jackley. Polls show a tight race. The battle has escalated after a former employee of Jackley's accused the Attorney General, in a Noem campaign ad, of dismissing her claims of workplace sexual harassment.",
    "video": "<iframe width=\"637\" height=\"425\" src=\"https://www.youtube.com/embed/wPD7OJ7NhvU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
    "html": "<div class=\"overview\">    The 2018 South Dakota gubernatorial primary pits U.S. Rep. Kristi Noem against state Attorney General Marty Jackley. Polls <a href=\"https://www.argusleader.com/story/news/politics/2018/05/29/governors-race-argus-leader-kelo-poll-south-dakota-governor-marty-jackley-kristi-noem/649292002/\" target=\"_blank\">show a tight race</a>. The battle has escalated after a former employee of Jackley's accused the Attorney General, in a Noem campaign ad, of dismissing her claims of workplace sexual harassment.    <h2>On Behalf of Kristi Noem's Campaign, Laura Kaiser Accuses Marty Jackley of Dismissing Her Sexual Harassment Claims</h2>    The stark ad, titled \"Think,\" features nothing but Laura Kaiser, who is identified on-screen as a \"victim of sexual harassment.\" Kaiser speaks to the camera without background music, putting all the weight on her words.    <br><br>    \"I don't think Marty Jackley should be governor. I don't think he should be the attorney general,\" Kaiser says right at the beginning. That's a particularly harsh statement for a candidate's campaign to air against a fellow party member in a primary.    <br><br>    Screen text further explains that \"after she reported\" the sexual harassment \"she was demoted, transferred and lost her job.\"    <br><br>    \"I don't think that he should be in a position of power when he can't be trusted to follow the law, \" Kaiser continues, \"The federal law is very specific, and is completely against retaliation against victims.\"    <h2>Kaiser Says Jackley Shouldn't Be Governor ... Or Attorney General</h2>    As she speaks, the screen reads, \"Marty Jackley dismissed her claims. An Aberdeen jury awarded Kaiser $1.5 million for the retaliation she faced.\"    <br><br>    (In a <a href=\"http://www.keloland.com/news/article/investigates/exclusive-former-dci-agent-details-retaliation-response\" target=\"_blank\">December 2017 interview</a>, Jackley didn't deny rejecting Kaiser's grievance, but he also said the alleged harasser was later fired.)    <br><br>    The ends with Kaiser declaring, \"You can't be above the law just because you're the one that enforces it.\" Noem's name is never mentioned, save for the \"Paid for by Kristi for Governor\" identifier at the bottom of the screen.    <br><br>    The #MeToo movement has driven many Democratic women to run for office, but this is a rare Republican contest impacted by the huge increase in women sharing their stories of sexual misconduct. Noem's political consultants are presuming that the Kaiser's #MeToo story will resonate with state's conservative primary electorate, and dissuade them from backing Jackley. They find out soon enough if that's true.    </div>"
  },
  {
    "name": "Most Racist Political Ad Since Willie Horton?",
    "excerpt": "Florida House Speaker Richard Corcoran is likely to run for governor of his state – but first the Republican has to out-do his Trump-backed primary opponent, fellow Republican Ron DeSantis. And what better way to out-Trump a Trumpster, than to fight to the death, wielding the red meat of what the Miami Herald editorial page calls \"race-baiting.\" ",
    "video": "<iframe width=\"637\" height=\"425\" src=\"https://www.youtube.com/embed/MVhnhwvCFvE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
    "html": "<div class=\"overview\">    Florida House Speaker Richard Corcoran is likely to run for governor of his state – but first the Republican has to out-do his Trump-backed primary opponent, fellow Republican Ron DeSantis. And what better way to out-Trump a Trumpster, than to fight to the death, wielding the red meat of what the Miami Herald editorial page calls \"race-baiting.\"    <h2>Donald Trump's State of the Union in Political Ad Form</h2>    President Donald Trump brought the families of Kayla Cuevas and Nisa Mickens to his first State of the Union address Tuesday night, and during the course of his speech he explained how the two teenaged girls were brutally murdered by MS-13 gang members on Long Island. The devastating story was used to make a larger point on immigration –&nbsp;that immigrants from other countries can pose a legitimate physical danger to American citizens and particularly children.    <br><br>    Many people take fierce exception to Trump's argument of course. Aside from the audible laughter and scoffs in the room when the president made his point, many people have since pointed out that Trump's conflation of illegal immigration and crime – specifically violent crime – just simply doesn't have the evidence to back it up (aside from the cherry-picked examples Trump and his allies often turn to).    <br><br>    Whatever view, it almost seems like Watchdog PAC – the pro-Corcoran super PAC responsible for this ad – got an advanced copy of Trump's speech. In the ad, mischievously titled \"Preventable,\" a young red-haired girl is strolling through her visibly-suburban neighborhood when she is approached by the stereotypically hooded and bearded \"illegal immigrant.\" Without so much as a word or second thought, the \"illegal immigrant\" pulls a gun on the young woman and randomly shoots her in the street. Her shocked and dismayed face is that last thing we see as her body slumps towards the sidewalk.    <br><br>    \"A young woman, gunned down by an illegal immigrant who should have been deported but was protected by a Sanctuary city,\" Corcoran says. \"When I heard Kate Steinle's story, I thought of my own daughter Kate, and how this could have happened to any family, anywhere.\"    <br><br>    The shooting of Kate Steinle that Corcoran is referring to took place in San Francisco in 2015. In that case, a single shot was fired by a homeless man and undocumented immigrant –&nbsp;the bullet hit the concrete pier first, ricocheted 78 feet and hit Steinle in the back. After parsing the evidence (which did not match up with the national narrative Trump was creating) the jury voted to acquit the shooter Jose Ines Garcia Zarate of murder and involuntary manslaughter. Since the moment the incident happened, Steinle's murder has been used a the perfect \"I told you so\" evidence used by anti-immigration activists and politicians to demonize Sanctuary City policies.    <br><br>    Corcoran's retelling of the case is overly-simplistic at best –&nbsp;but nevertheless his ad serves as yet another scare tactic to demonize the idea of \"Sanctuary\" cities, which have become a huge target in the GOP-led war on immigration of all types – including legal immigration, as Trump explained in his State of the Union.    <br><br>    Corcoran's political action committee, Watchdog PAC, which created this ad, spent $95,560 to run the 30-second spot more than 700 times on Fox News channels in central Florida cities, including Jacksonville, Pensacola, Orlando, Tampa and St. Petersburg.    <h2>Richard Corcoran Gubernatorial Run Practically Inevitable</h2>    According to the <a href=\"http://www.miamiherald.com/news/politics-government/state-politics/article197293659.html\">Miami Herald</a>, the \"explosive ad minimizes any remaining doubt about Corcoran's potential run for governor,\" which he said he will decide formally after the legislative sessions wraps up in March.    <br><br>    But it is not surprising that in a state like Florida – which <a href=\"https://www.politico.com/story/2016/11/florida-results-not-in-2016-231004\">Trump won by 1.4 percentage points</a> (which is actually a lot) –&nbsp;a candidate for governor would try to adopt the Trump playbook as closely as possible.    <br><br>    And that pretty much guarantees that the Republican primary in Florida's gubernatorial race is going to be one of the most exciting to watch this cycle.    </div>"
  },
  {
    "name": "Dean Heller Ties Jacky Rosen To “Hanoi Jane”",
    "excerpt": "Even though Nevada hasn't held its primary yet, incumbent Republican Sen. Dean Heller is already presuming Jacky Rosen will be his opponent, and isn't wasting time leveling attacks.",
    "video": "<iframe width=\"637\" height=\"425\" src=\"https://www.youtube.com/embed/96EfKbKOO8M\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
    "html": "<div class=\"overview\">    Even though Nevada hasn't held its primary yet, incumbent Republican Sen. Dean Heller is already presuming Jacky Rosen will be his opponent, and isn't wasting time leveling attacks.    <br><br>    The ad \"Priorities\" uses footage from Heller's April 20th, 2018 campaign rally, in which he thanked military veterans in attendance for their service, then mocked Rosen for being in Hollywood at the same time, attending a fundraiser with Jane Fonda. But Heller doesn't use the actress' name, he calls her \"Hanoi Jane.\"    <h2>Heller Resurrects Derisive Nickname for Jane Fonda</h2>    Heller is resurrecting the derisive nickname hung on Fonda during the Vietnam War, when she was an anti-war activist and was photographed with communist North Vietnamese soldiers.    <br><br>    \"My opponent right now is breaking bread with Hanoi Jane, Heller says on the stump, \"This is the same Hanoi Jane that said it was understandable that our military men were being tortured in Vietnam.\"    <br><br>    As Heller speaks, we see a grainy photo of Rosen at the Hollywood fundraiser. You can be sure Heller's media consultants were gnashing their teeth because their campaign tracker couldn't get a shot of Rosen and Fonda together. Instead, the ad settles for a juxtaposition of a contemporary shot of Rosen followed by the vintage photo of Fonda in front of North Vietnam's anti-aircraft weapons.    <h2>Dean Heller Says Jacky Rosen Chose Hollywood Over Veterans</h2>    The question for Heller is: how many voters still care about what Jane Fonda did more than 40 years ago, something that she has <a href=\"https://www.washingtonpost.com/news/retropolis/wp/2017/09/18/how-jane-fondas-1972-trip-to-north-vietnam-earned-her-the-nickname-hanoi-jane/?utm_term=.d85971dc1b76\" rel=\"noopener\" target=\"_blank\">apologized</a> for on several occasions and did not, in the end, derail her acting career. Moreover, many voters weren't even born when that happened.    <br><br>    Heller's political consultants clearly believe either enough voters do remember what she did, considering that the midterm electorate will likely skew older than the nation as a whole, or that any association with a Hollywood liberal is sufficiently damning. That may explain why towards the end of the ad, Heller charges Rosen with choosing \"Hollywood\" over the \"300,000 veterans\" in Nevada.    </div>"
  },
  {
    "name": "Pat Ryan Offers Modest Proposal To Protect Kids From School Shootings",
    "excerpt": "Pat Ryan, a military veteran running in the New York 19th congressional district's Democratic primary, has released a deliberately jarring ad designed to make the case for an assault weapons ban, as well as highlight his military service.",
    "video": "<iframe width=\"637\" height=\"425\" src=\"https://www.youtube.com/embed/yhfSsvSfvCM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
    "html": "<div class=\"overview\">    Pat Ryan, a military veteran running in the New York 19th congressional district's Democratic primary, has released a deliberately jarring ad designed to make the case for an assault weapons ban, as well as highlight his military service.    <h2>Pat Ryan Depicts Schoolchildren In Military Gear</h2>    In \"What Makes More Sense To You?\" Ryan begins by mentioning not just his tours of duty in Iraq, but also the business he started upon returning home, \"to find the best technology to protect our soldiers.\"    <br><br>    After footage of combat, Ryan holds up an assault rifle, noting that his company was creating gear protecting soldiers \"from weapons like this.\"    <br><br>    Then Ryan laments how such weapons are using in school shootings. \"If our children are going up against this,\" as he raises his rifle, \"they should have the same protection we give our soldiers.\"    <br><br>    We then see the shocking imagery of children at school wearing military helmets and ballistic vests.    <h2>Pat Ryan Following The Cue Of PA Primary Winner George Scott</h2>    Ryan, shifting his tone slightly, concludes, \"or we could just get rid of assault rifles. What makes more sense to you?\" The final frame is a close-up of a young girl in a classroom wearing an camouflage helmet.    <br><br>    Ryan may be heartened by the fact that another <a href=\"https://iagreetosee.com/portfolio/george-scott-burns-assault-rifle/\" rel=\"noopener\" target=\"_blank\">provocative gun control ad by Pennsylvania's George Scott</a> appears to have helped him <a href=\"https://www.vox.com/policy-and-politics/2018/5/16/17360444/george-scott-pennsylvania-primary-election-gun-fire\" rel=\"noopener\" target=\"_blank\">win </a>a tight primary race in that state's Tenth District.    </div>"
  },
  {
    "name": "Can Jim Renacci Channel Donald Trump?",
    "excerpt": "Who do Ohio Republicans like more: their party's governor John Kasich, or their party's president Donald Trump? The newest contestant in the gubernatorial primary, Rep. Jim Renacci, is betting on Trump.",
    "video": "<iframe width=\"637\" height=\"425\" src=\"https://www.youtube.com/embed/nKllby8DSg8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
    "html": "<div class=\"overview\">      Who do Ohio Republicans like more: their party's governor John Kasich, or their party's president Donald Trump? The newest contestant in the gubernatorial primary, Rep. Jim Renacci, is betting on Trump.      <br><br>      Renacci is squaring off against Lt. Gov. Mary Taylor, who has the backing of Kasich. So Renacci's announcement video appropriates Trump's \"America First\" mantra for his state – \"Ohio First\" – and portrays himself as a successful business man who will shake up the state capital.      <h2>Jim Renacci Says ‘Ohio First’</h2>      The \"Ohio First\"&nbsp; video begins with a leather-clad Renacci taking a ride on a Harley – he partially owns three Harley-Davidson dealerships – as residents tout him as an political outsider.      <br><br>      \"Ohio is tired of status quo,\" says the first man on the street, in a clear swipe at Kasich and Taylor, not to mention the Republican-controlled state legislature. \"The career politicians and stuff that's out there cannot move this state forward.\"      <br><br>      We then see Renacci tell a small crowd, \"It is essential we get career politicians out of the way [and] put business leaders in who understand what it means to make a payroll.\"      <h2>Renacci Implicitly Swipes Gov. John Kasich</h2>      Between clips of Renacci crossing the state on his motorcycle, we get more testimonials lambasting those in power, with accusations of a \"pay-to-play system\" and a desire for \"a different view and a different voice.\"      <br><br>      While the Renacci ad rails against those \"career politicians,\" it leaves out that Renacci has been a U.S. congressman for the last six years, and served as a mayor before that. But such minor details may not matter if Ohio Republicans – who <a href=\"https://iagreetosee.com/portfolio/donald-trump-goes-negative-on-john-kasich/\">backed Kasich over Trump</a> in the 2016 presidential primary – have grown increasingly displeased with the current lot in Columbus.    </div>"
  },
  {
    "name": "Here’s What David Trone Likes To Kiss (And What He Doesn’t)",
    "excerpt": "David Trone, a liquor store chain tycoon, is a Democratic primary candidate in Maryland's Sixth Congressional District. As he is self-funding his candidacy, he's pitching himself as untainted by special interest donations.",
    "video": "<iframe width=\"637\" height=\"425\" src=\"https://www.youtube.com/embed/2-G7eVEZlgg\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
    "html": "<div class=\"overview\">    David Trone, a liquor store chain tycoon, is a Democratic primary candidate in Maryland's Sixth Congressional District. As he is self-funding his candidacy, he's pitching himself as untainted by special interest donations.    <br><br>    Trone's media consultants figured the best way to make the case that he is free from special interest influence, is to front-load an advertisement with lots of cute babies.    <h2>David Trone Likes Kissing Babies...</h2>    \"Yea, David Trone likes kissing babies, lots of babies\" says a narrator, during a montage of political baby-kissing over a jaunty blues score. \"After all, he raised a bunch of them,\" the narrator adds as we see an a old photo of three of Trone's own four kids.    <br><br>    While Trone is shown conversing with constituents, the narrator pivots to politics: \"But the reason David's not taking a dime from PACS, lobbyists and corporations, is so he never has to kiss any...\"    <br><br>    The narrator trails off. Trone, holding one more baby, turns to the camera and gives a knowing nod. Then the screen turns black save for the text, \"Well ... you know.\"    <h2>...He Doesn't Like Kissing Donors' ... \"Well ... You Know\"</h2>    With the not-so-subtle reference to ass-kissing completed, the narrator concludes, \"David Trone intends to be our congressman, not theirs.\" A billboard declares that Trone's campaign has \"No PACS. No lobbyists. No kidding.\"    <br><br>    Left unsaid is the reason why Trone can so easily make that pledge: he's funding his campaign with personal wealth. Emphasizing his bankbook might have more appeal to the general electorate, but among more liberal Democratic primary voters, it's a point Trone's political consultants probably don't want to shout from the rooftops.    </div>"
  }
]
